Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment.Type Property
 The type of the surfacing.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SurfaceTreatment.SurfaceTypeEnum Type { get; set; }
Public Property Type As SurfaceTreatment.SurfaceTypeEnum
	Get
	Set
Property Value
Type: SurfaceTreatment.SurfaceTypeEnum
See Also
Reference
SurfaceTreatment Class
Tekla.Structures.Model Namespace